; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v13 ?v3)
             (pred_7 ?v11 ?v1)
             (pred_1 ?v13 ?v1)
             (pred_8 ?v4 ?v13 )
	     (pred_4 ?v13)
             (pred_5 ?v8)
             (pred_3 ?v11)
             (pred_9 ?v1)
             (pred_11 ?v13)
             (pred_6 ?v11)
             (pred_2 ?v13)
             (pred_10 ))



(:action op_3
:parameters (?v6 ?v2 ?v10 ?v7)
:precondition (and (pred_5 ?v6) (pred_5 ?v2) (pred_3 ?v10) (pred_9 ?v7)
          (pred_12 ?v6 ?v2) (pred_7 ?v10 ?v7)
                   (pred_1 ?v2 ?v7) (pred_4 ?v6) 
                   (pred_11 ?v2) (pred_6 ?v10))
:effect (and  (pred_2 ?v2) (not (pred_11 ?v2))))


(:action op_4
:parameters (?v6 ?v5)
:precondition (and (pred_5 ?v6) (pred_5 ?v5)
               (pred_4 ?v6) (pred_12 ?v6 ?v5) (pred_2 ?v5))
:effect (and (pred_4 ?v5) (not (pred_4 ?v6))))

(:action op_1
:parameters (?v6 ?v10)
:precondition (and (pred_5 ?v6) (pred_3 ?v10) 
                  (pred_4 ?v6) (pred_8 ?v10 ?v6) (pred_10 ))
:effect (and (pred_6 ?v10)
   (not (pred_8 ?v10 ?v6)) (not (pred_10 ))))


(:action op_5
:parameters (?v6 ?v9 ?v12)
:precondition (and (pred_5 ?v6) (pred_3 ?v9) (pred_3 ?v12)
                  (pred_4 ?v6) (pred_6 ?v12) (pred_8 ?v9 ?v6))
:effect (and (pred_6 ?v9) (pred_8 ?v12 ?v6)
        (not (pred_6 ?v12)) (not (pred_8 ?v9 ?v6))))

(:action op_2
:parameters (?v6 ?v10)
:precondition (and (pred_5 ?v6) (pred_3 ?v10) 
                  (pred_4 ?v6) (pred_6 ?v10))
:effect (and (pred_10 ) (pred_8 ?v10 ?v6) (not (pred_6 ?v10)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_02 obj_01 obj_05 obj_06
    obj_04
    obj_03
    )

    (:init
       (pred_10)

       (pred_5 obj_02)
       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_9 obj_04)
       (pred_3 obj_03)

       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_05)
       (pred_11 obj_06)
       (pred_1  obj_06 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_05)

       (pred_7  obj_03 obj_04)
       (pred_8 obj_03 obj_02)
       (pred_4 obj_05)
    )

    (:goal (and
       (pred_8 obj_03 obj_06)
    ))
(:constraints
  (always (not (pred_4 obj_01)))
)
)

; plan
1. (op_4 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_02)
   goals met: 0 of 1
2. (op_1 obj_02 obj_03)
   deleted: (pred_8 obj_03 obj_02) (pred_10)
   added: (pred_6 obj_03)
   goals met: 0 of 1
3. (op_4 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_05)
   goals met: 0 of 1
4. (op_3 obj_05 obj_06 obj_03 obj_04)
   deleted: (pred_11 obj_06)
   added: (pred_2 obj_06)
   goals met: 0 of 1
5. (op_4 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 0 of 1
6. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_03)
   added: (pred_10) (pred_8 obj_03 obj_06)
   goals met: 1 of 1
